In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('raw_data.csv')

In [3]:
df.sample(10)

      bed  bath  square         city  year_built     home_type   price
375   1.0   1.0   500.0      Hoboken         1.0         CONDO  2050.0
1137  2.0   1.0  1031.0   Union City         1.0     APARTMENT  1650.0
1135  2.0   1.0   741.0   Union City         1.0  MULTI_FAMILY  1514.0
43    1.0   1.0  1023.0      Hoboken         NaN           NaN  2175.0
601   1.0   1.0  1095.0  Jersey City         NaN           NaN  4100.0
1061  1.0   1.0   725.0  Jersey City         NaN           NaN  2450.0
1138  1.0   1.0   550.0   Union City         1.0  MULTI_FAMILY  1300.0
1198  1.0   1.0   650.0   Union City         NaN           NaN  1395.0
1139  1.0   1.5   895.0   Union City         1.0  MULTI_FAMILY  1350.0
204   3.0   1.0  1100.0      Hoboken      1921.0     APARTMENT  3500.0

In [4]:
df.describe()

               bed         bath       square   year_built         price
count  1350.000000  1350.000000  1350.000000   626.000000   1350.000000
mean      1.772593     1.207778  1014.608148   498.289137   2548.493333
std       0.908402     0.454749   337.956803   849.723815   1124.865636
min       0.000000     0.500000   400.000000     1.000000    998.000000
25%       1.000000     1.000000   803.500000     1.000000   1795.000000
50%       2.000000     1.000000  1095.000000     1.000000   2300.000000
75%       2.000000     1.000000  1095.000000  1888.500000   2975.000000
max       6.000000     4.000000  5000.000000  2017.000000  13000.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1350 entries, 0 to 1349
Data columns (total 7 columns):
bed           1350 non-null float64
bath          1350 non-null float64
square        1350 non-null float64
city          1350 non-null object
year_built    626 non-null float64
home_type     626 non-null object
price         1350 non-null float64
dtypes: float64(5), object(2)
memory usage: 73.9+ KB

In [6]:
df['bed'].value_counts()

2.0    509
1.0    501
3.0    235
0.0     64
4.0     37
5.0      3
6.0      1
Name: bed, dtype: int64

In [7]:
df['bath'].value_counts()

1.0    1081
2.0     217
1.5      27
3.0      10
2.5       7
4.0       5
3.5       2
0.5       1
Name: bath, dtype: int64

In [8]:
df['bed'] = df['bed'].astype('int')

In [9]:
df['square'] = df['square'].astype('int')

In [10]:
df['price'] = df['price'].astype('int')

In [11]:
df['year_built'] = df['year_built'].fillna(0)

In [12]:
df['year_built'] = df['year_built'].astype('int')

In [13]:
df['home_type'] = df['home_type'].fillna('None')

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1350 entries, 0 to 1349
Data columns (total 7 columns):
bed           1350 non-null int64
bath          1350 non-null float64
square        1350 non-null int64
city          1350 non-null object
year_built    1350 non-null int64
home_type     1350 non-null object
price         1350 non-null int64
dtypes: float64(1), int64(4), object(2)
memory usage: 73.9+ KB

In [15]:
df.describe()

               bed         bath       square   year_built         price
count  1350.000000  1350.000000  1350.000000  1350.000000   1350.000000
mean      1.772593     1.207778  1014.608148   231.058519   2548.493333
std       0.908402     0.454749   337.956803   629.533862   1124.865636
min       0.000000     0.500000   400.000000     0.000000    998.000000
25%       1.000000     1.000000   803.500000     0.000000   1795.000000
50%       2.000000     1.000000  1095.000000     0.000000   2300.000000
75%       2.000000     1.000000  1095.000000     1.000000   2975.000000
max       6.000000     4.000000  5000.000000  2017.000000  13000.000000

In [16]:
df.sample(10)

      bed  bath  square         city  year_built     home_type  price
840     1   1.0    1300  Jersey City        2006     APARTMENT   1800
427     2   1.0    1095      Hoboken           0          None   2600
154     1   1.0     850      Hoboken           0          None   2999
1083    1   1.0    1095  Jersey City           0          None   1400
856     3   1.0    1095  Jersey City           0          None   1595
172     3   2.0    1980      Hoboken        2015         CONDO  10000
364     2   1.0     660      Hoboken           1     APARTMENT   1800
779     1   1.0     650  Jersey City           0          None   1373
1343    1   1.0     600   Union City           1  MULTI_FAMILY   1750
785     2   1.0    1095  Jersey City           0          None   3600

In [17]:
df['city'].value_counts()

Jersey City      630
Hoboken          495
Union City       212
HOBOKEN            5
North Bergen       3
Jersey city        2
West New York      2
UNION CITY         1
Name: city, dtype: int64

In [18]:
df.loc[df['city'] == 'HOBOKEN'] = 'Hoboken'
df.loc[df['city'] == 'JERSEY CITY'] = 'Jersey City'
df.loc[df['city'] == 'Jersey city'] = 'Jersey City'
df.loc[df['city'] == 'UNION CITY'] = 'Union City'

In [19]:
df = df[df.city != 'North Bergen']
df = df[df.city != 'West New York']

In [20]:
df['city'].value_counts()

Jersey City    632
Hoboken        500
Union City     213
Name: city, dtype: int64

In [21]:
df['year_built'].value_counts()

0              722
1              459
1901            32
1910            10
1900             8
1920             7
2006             6
2005             6
Hoboken          5
2000             4
2015             4
1987             4
2008             4
1921             3
1985             3
1990             3
2002             3
2014             3
1930             3
1907             2
2016             2
1898             2
1897             2
1892             2
1890             2
1889             2
1924             2
1928             2
2017             2
2007             2
1950             2
2013             2
1960             2
Jersey City      2
2010             2
2009             2
2004             2
1940             1
1800             1
1970             1
Union City       1
1880             1
1887             1
2012             1
2011             1
2001             1
1929             1
1905             1
1999             1
1908             1
1989             1
1913             1
1916             1
1917             1
1973             1
1925             1
1932             1
Name: year_built, dtype: int64

In [22]:
df['home_type'].value_counts()

None                 722
APARTMENT            491
MULTI_FAMILY          76
CONDO                 29
TOWNHOUSE             12
SINGLE_FAMILY          6
Hoboken                5
Jersey City            2
HOME_TYPE_UNKNOWN      1
Union City             1
Name: home_type, dtype: int64

In [23]:
df.to_csv('clean_data.csv')